In [1]:
import pandas as pd
import numpy as np
new_lab = pd.read_csv("df_labdata.csv")
new_lab.rename(columns={"test_result": "result", "test_unit": 'Units'}, inplace = 'True')
old_lab = pd.read_csv('TMA_lab.csv')
old_lab['Lab_Date'] = pd.to_datetime(old_lab.Lab_Date)
old_lab.rename(columns={"Lab_Date": "date", "Results": "result", "Code": "test_name"}, inplace = 'True')

In [3]:
master = pd.read_csv("master.csv")

In [4]:
master.head(2)

,Unnamed: 0,TMA_Acct,Account_Date,Sex,DOB,Marital_Status,Race,Location,Zip_Code,Patient_Status_Date,Patient_Status,Ethnicity,Language
0,0,9,06-01-2009,Male,20-04-1921,NaN,White,Hopewell Office,15001,6-30-2010,Deceased,NaN,NaN
1,1,10,06-01-2009,Female,18-05-1926,NaN,NaN,Tma,15360,NaN,Active,NaN,NaN

In [ ]:
master[master['Account_Date'] < '']

In [8]:
new_lab.head(2)

,Unnamed: 0,TMA_Acct,dos_deidentified,clinic_name_deidentified,test_name,result,Units,abnormal_flag,range_low_value,range_high_value,loinc_code,date
0,0,1483,15,1.0,rbc/hpf cells,0.0,NaN,,0.0,3.0,58081,2010-01-16
1,1,49053,2759,2.0,ld,237.0,UNITS,,120.0,250.0,25320,2017-07-22

In [3]:
def get_unit(new_lab, old_lab, name):
    for i in name:
        result = []
        unit1 = list(old_lab[old_lab['test_name'] == i]['Units'])
        unit2 = list(new_lab[new_lab['test_name'] == i]['Units'])
        result.extend(unit1)
        result.extend(unit2)
        result = list(set(list(result)))
        result = list(filter(None, result))
        print(i + ": ", end ="")
        print(result)

In [28]:
ur = ['24 hr urine creatin',
 '24 hr urine creatinine'
 'albumin/creatinine ratio, rand',
 'bun creatinine ratio',
 'bun/creatinine ratio',
 'calcium creatinine ratio',
 'calcium/creatinine ratio',
 'chloride/creatinine ratio',
 'creatin',
 'creatine',
 'creatine kinase, total',
 'creatine kinase,total',
 'creatine, serum',
 'creatine, urine (24 hr.)',
 'creatine, urine -per volume',
 'creatine,24 hour urine',
 'creatine,serum',
 'creatininb',
 'creatinine',
 'creatinine [mass/volume] in serum or plasma',
 'creatinine [mass/volume] in urine',
 'creatinine clearance',
 'creatinine total',
 'creatinine urine',
 'creatinine with gfr',
 'creatinine, 24 hour urine',
 'creatinine, 24 hr urine',
 'creatinine, random ur',
 'creatinine, random urine',
 'creatinine, random, urine',
 'creatinine, u',
 'creatinine, urine',
 'creatinine, urine (24 hr.)',
 'creatinine, urine -per volume',
 'creatinine, urine 12hr',
 'creatinine, urine random',
 'creatinine, urine, random',
 'creatinine,24 hour urine',
 'creatinine,peritoneal fluid',
 'creatinine,random urine',
 'creatinine,serum',
 'creatinine,urine',
 'lab report: microalbumin/creatinine ratio, urinaly',
 'micro albumin/creatinine ratio',
 'microalbumin creatinine ratio',
 'microalbumin creatinine ratio/random ur',
 'microalbumin/ creatinine ratio, urine',
 'microalbumin/creatinine [ratio] in urine',
 'microalbumin/creatinine ratio',
 'microalbumin/creatinine ratio,',
 'microalbumin/gm creatinine',
 'microalbumin/mg creatinine',
 'phosphate/creatinine ratio',
 'potassium/creatinine ratio',
 'protein creatinine ratio',
 'protein/creatinine ratio',
 'random urine creatinine',
 'sodium/creatinine ratio',
 'uric acid/creatinine ratio',
 'urine creatinine test strip'
]
get_unit(new_lab, old_lab, ur)

24 hr urine creatin: [nan]
24 hr urine creatinine: ['g/24hrs']
albumin/creatinine ratio, rand: ['mcg/mg creat']
bun creatinine ratio: [nan]
bun/creatinine ratio: [nan, '(calc)', 'Ratio']
calcium creatinine ratio: [nan]
calcium/creatinine ratio: ['mg/g creat']
chloride/creatinine ratio: [nan, 'mmol/g creat', 'MMOL/G CREAT']
creatin: [nan]
creatine: [nan]
creatine kinase, total: ['U/L']
creatine kinase,total: ['U/L', 'UNITS']
creatine, serum: ['mg/dL']
creatine, urine (24 hr.): ['mg/d']
creatine, urine -per volume: ['mg/dL']
creatine,24 hour urine: ['mg/24 h']
creatine,serum: ['mg/dL']
creatininb: [nan, 'MG/DL']
creatinine: [nan, 'MG/DL', 'ClosedMG/DL', 'mg/dl', 'mg/dL']
creatinine [mass/volume] in serum or plasma: ['mg/dL']
creatinine [mass/volume] in urine: [nan]
creatinine clearance: [nan, 'mL/min', 'ML/MIN']
creatinine total: ['MG/24 HR']
creatinine urine: ['mg/day', 'MG/DAY']
creatinine with gfr: [nan]
creatinine, 24 hour urine: ['g/24 h']
creatinine, 24 hr urine: ['MG/24 HRS']
creatinine, random ur: ['MG/DL']
creatinine, random urine: ['mg/dL']
creatinine, random, urine: ['mg/dL']
creatinine, u: ['mg/spec']
creatinine, urine: [nan, 'g/24 h']
creatinine, urine (24 hr.): ['L', 'mg/d']
creatinine, urine -per volume: ['mg/dL']
creatinine, urine 12hr: ['mg/12 hr']
creatinine, urine random: ['MG/DL']
creatinine, urine, random: [nan, 'mg/dL']
creatinine,24 hour urine: [nan, 'G/24HR', 'g/24 h', 'g/24hr', 'G/24 HOURS', 'G/24 H']
creatinine,peritoneal fluid: ['mg/dL']
creatinine,random urine: ['mg/dL', 'MG/DL']
creatinine,serum: ['MG/DL']
creatinine,urine: ['MG/DL']
lab report: microalbumin/creatinine ratio, urinaly: [nan]
micro albumin/creatinine ratio: ['mg/g_cre']
microalbumin creatinine ratio: ['MG/G CREAT', 'MCG/MG CREAT']
microalbumin creatinine ratio/random ur: [nan]
microalbumin/ creatinine ratio, urine: ['mg/L', 'mcg/mg Creat']
microalbumin/creatinine [ratio] in urine: [nan]
microalbumin/creatinine ratio: ['mcg/mg Creatin', 'mcg/mg Creat']
microalbumin/creatinine ratio,: ['mcg/mg creat']
microalbumin/gm creatinine: ['MG/GM CREAT']
microalbumin/mg creatinine: ['MCG/MG CREAT.']
phosphate/creatinine ratio: [nan, 'mg/g creat']
potassium/creatinine ratio: ['mmol/g creat', 'MMOL/G CREAT']
protein creatinine ratio: [nan, 'MG/G CREATININE']
protein/creatinine ratio: [nan, 'MG/G CREATININE', 'mg/g creat', 'MG/MG CREATININE', 'mg/mg creat', 'g/dL', 'Ratio']
random urine creatinine: ['mg/dL']
sodium/creatinine ratio: [nan, 'mmol/g creat', 'MMOL/G CREAT']
uric acid/creatinine ratio: ['mg/g creat', 'MG/G CREAT']
urine creatinine test strip: [nan, '1']

In [4]:
co2 = ['carbon dioxide (co2)',
 'co2',
 'pco2',
 'pco2(t)',
 'pco2(t)-v',
 'pco2-v',
 'pco2-ve',
 'total co2'
]
get_unit(new_lab, old_lab, co2)

carbon dioxide (co2): ['mmol/L']
co2: ['mEq/L', 'mmol/L']
pco2: ['mm[Hg]', 'mmHg', 'mm Hg']
pco2(t): ['mmHg']
pco2(t)-v: ['mmHg']
pco2-v: ['mmHg']
pco2-ve: ['mmHg']
total co2: ['mmol/L']

In [20]:
new_lab[new_lab['test_name'] == 'total co2']

Empty DataFrame
Columns: [Unnamed: 0, TMA_Acct, dos_deidentified, clinic_name_deidentified, test_name, result, Units, abnormal_flag, range_low_value, range_high_value, loinc_code, date]
Index: []

In [19]:
old_lab[old_lab['test_name'] == 'total co2']

,Unnamed: 0,TMA_Acct,date,test_name,result,Lab_Company,Status,Units,Order_Doctor
650610,650610,14827,2011-09-12,total co2,33.8,Heritage Valley Health System,Closed,mmol/L,Joshua C. Sysak DO
669955,669955,15215,2011-10-30,total co2,23.2,Heritage Valley Health System,Closed,mmol/L,Allen I. Wolfert MD
1292172,1292172,32511,2011-08-17,total co2,39.3,Heritage Valley Health System,Closed,mmol/L,Allen I. Wolfert MD
1294960,1294960,32585,2011-09-03,total co2,29,Heritage Valley Health System,Closed,mmol/L,"Matthew Pesacreta, MD"
1295018,1295018,32585,2011-09-20,total co2,29.7,Heritage Valley Health System,Closed,mmol/L,"Matthew Pesacreta, MD"
1299036,1299036,32692,2011-09-07,total co2,27.1,Heritage Valley Health System,Closed,mmol/L,Joshua C. Sysak DO
1317511,1317511,33116,2011-11-17,total co2,29.7,Heritage Valley Health System,Closed,mmol/L,"Matthew Pesacreta, MD"
1341096,1341096,33707,2012-02-05,total co2,24.8,Heritage Valley Health System,Closed,mmol/L,Allen I. Wolfert MD
1677360,1677360,43398,2015-10-25,total co2,32.9,Heritage Valley Health System,Closed,mmol/L,"Nirav D. Patel, M.D."
1978518,1978518,3053,2017-07-27,total co2,39.8,Heritage Valley Health System,Closed,mmol/L,"Matthew Pesacreta, MD"
2209466,2209466,28640,2017-11-21,total co2,29.9,Heritage Valley Health System,Closed,mmol/L,"Tsegaw E Egziti, MD"
2235899,2235899,39961,2017-10-26,total co2,25.4,Heritage Valley Health System,Closed,mmol/L,"Tsegaw E Egziti, MD"

In [26]:
hemo = ['carboxy hemoglobin',
 'erythrocyte mean corpuscular hemoglobin [entitic m',
 'hemobl c',
 'hemoblob f',
 'hemodilution',
 'hemogl a',
 'hemogl a1c',
 'hemogl a2',
 'hemogl ele',
 'hemogl s',
 'hemoglob',
 'hemoglobin',
 'hemoglobin [mass/volume] in blood',
 'hemoglobin a',
 'hemoglobin a1',
 'hemoglobin a1c',
 'hemoglobin a2',
 'hemoglobin and hematocrit',
 'hemoglobin casts',
 'hemoglobin f',
 'hemoglobin glyclated (hgb a1c) (83036)',
 'hemoglobin s',
 'hemoglobin,free,plasma',
 'hemoglobin,plasma',
 'hemoglobin,qual',
 'hemogram',
 'hemogram w/ platelet ct.',
 'hemogrm',
 'hereditary hemochrom dna',
 'lab report: hemoglobin a1c',
 'mean corpuscular hemoglobin',
 'mean corpuscular hemoglobin conc',
 'methemoglo',
 'total hemoglobin'
]
get_unit(new_lab, old_lab, hemo)

carboxy hemoglobin: ['%']
erythrocyte mean corpuscular hemoglobin [entitic m: ['pg']
hemobl c: [nan]
hemoblob f: [nan]
hemodilution: [nan]
hemogl a: [nan]
hemogl a1c: [nan, '%', '1']
hemogl a2: [nan, '%']
hemogl ele: [nan]
hemogl s: [nan]
hemoglob: [nan]
hemoglobin: [nan, 'g/dL', 'g/dl', 'GM/DL', 'ClosedGM/DL', 'gm/dL', 'G/DL']
hemoglobin [mass/volume] in blood: ['g/dL']
hemoglobin a: ['PERCENT']
hemoglobin a1: ['%']
hemoglobin a1c: ['% of total HgB', '% OF TOTAL HGB', 'PERCENT', '% of total Hgb']
hemoglobin a2: ['PERCENT']
hemoglobin and hematocrit: [nan]
hemoglobin casts: [nan, 'LPF']
hemoglobin f: ['PERCENT']
hemoglobin glyclated (hgb a1c) (83036): [nan]
hemoglobin s: ['PERCENT']
hemoglobin,free,plasma: ['mg/dL']
hemoglobin,plasma: ['MG/DL']
hemoglobin,qual: [nan, 'G/DL']
hemogram: [nan]
hemogram w/ platelet ct.: [nan]
hemogrm: [nan]
hereditary hemochrom dna: [nan]
lab report: hemoglobin a1c: [nan]
mean corpuscular hemoglobin: ['pg']
mean corpuscular hemoglobin conc: ['g/dL']
methemoglo: [nan, '%']
total hemoglobin: ['g/dL']

In [25]:
po4 = ['alk phosphatase',
 'alk phosphatase,bone',
 'alkaline phosphatase',
 'alkaline phosphatase (alp)',
 'alkaline phosphatase [enzymatic activity/volume] i',
 'calcium phosphate crystal',
 'calcium phosphate crystals',
 'phosphate',
 'phosphate (as phosphorus)',
 'phosphate,24 hour urine',
 'phosphate,random urine',
 'phosphate/creatinine ratio',
 'phosphatidylserine ab (iga)',
 'phosphatidylserine ab (igg)',
 'phosphatidylserine ab (igm)',
 'prostatic acid phosphatase',
 'triple phosphate',
 'triple phosphate crystals'
]
get_unit(new_lab, old_lab, po4)

alk phosphatase: [nan, 'U/L']
alk phosphatase,bone: ['mcg/L']
alkaline phosphatase: ['U/L', 'IU/L', 'UNITS']
alkaline phosphatase (alp): ['U/L']
alkaline phosphatase [enzymatic activity/volume] i: ['U/L']
calcium phosphate crystal: ['L']
calcium phosphate crystals: [nan]
phosphate: ['MG/DL']
phosphate (as phosphorus): ['mg/dL']
phosphate,24 hour urine: ['MG/24 H']
phosphate,random urine: ['mg/dL']
phosphate/creatinine ratio: [nan, 'mg/g creat']
phosphatidylserine ab (iga): ['U/mL']
phosphatidylserine ab (igg): ['U/mL']
phosphatidylserine ab (igm): ['U/mL']
prostatic acid phosphatase: ['ng/mL']
triple phosphate: [nan, '/HPF', 'L']
triple phosphate crystals: [nan, '/HPF']

In [22]:
pth = ['intact pth',
 'ipth',
'calc (pth)',
'parathyrin.intact',
 'parathyroid hormone, intact',
 'pth',
 'pth ab',
 'pth calcium',
 'pth in',
 'pth intact',
 'pth n term',
 'pth, intact',
 'pth,int',
 'pth,intact',
 'pth,related protein',
 'pth-rp',
 'pthi w/oca',
 'pthintact'
]
get_unit(new_lab, old_lab, pth)

intact pth: ['pg/mL']
ipth: ['pg/mL']
calc (pth): [nan]
parathyrin.intact: ['pg/mL']
parathyroid hormone, intact: ['pg/mL']
pth: [nan, 'pg/mL']
pth ab: [nan]
pth calcium: ['mg/dL']
pth in: [nan, 'PG/ML']
pth intact: [nan, 'LPF', 'pg/mL', 'HPF', 'ClosedPG/ML', 'PG/ML', 'pg/ml']
pth n term: [nan, 'pg/mL']
pth, intact: ['pg/mL']
pth,int: [nan]
pth,intact: ['PG/ML']
pth,related protein: [nan, 'PG/ML', 'pg/mL']
pth-rp: [nan, 'pmol/L', 'pg/mL']
pthi w/oca: [nan, 'PG/ML']
pthintact: [nan, 'PG/ML']

In [23]:
protein = ['14-3-3 eta protein',
 '14.3.3 eta protein',
 'abnormal protein band 1',
 'abnormal protein band 2',
 'abnormal protein band 3',
 'alpha fetoprotein, tumor marke',
 'antiproteinase 3 (pr-3) abs',
 'apolipoprotein a1',
 'apolipoprotein b',
 'b2 glycoprotein i (igg)ab',
 'b2 glycoprotein i (igm)ab',
 'b2 glycoprotein i ab (iga)',
 'b2 glycoprotein i ab (igg)',
 'b2 glycoprotein i ab (igm)',
 'b2glycoprotein1, iga antibody',
 'b2glycoprotein1, igg antibody',
 'b2glycoprotein1, igm antibody',
 'c-reactive protein',
 'free protein s ag.',
 'igf binding protein 1 (igfbp 1',
 'igf binding protein-1',
 'lab report: protein electro, 24-hour urine',
 'lipoprotein (a)',
 'lp-pla2 lipoprotein',
 'monoclonal protein 1',
 'monoclonal protein 2',
 'mouse urine proteins (e72) ige',
 'protein',
 'protein 24 hour urine',
 'protein 24 hour volume',
 'protein [mass/volume] in serum or plasma',
 'protein c',
 'protein c activity',
 'protein c,activity',
 'protein c,antigen',
 'protein creatinine ratio',
 'protein s',
 'protein s,activity',
 'protein s,antigen',
 'protein urine random',
 'protein urine-qual',
 'protein, poc urine',
 'protein, random, urine',
 'protein, total',
 'protein, total serum',
 'protein, total, 24 hr ur',
 'protein, total, pleural',
 'protein, total, random ur',
 'protein, total-quest',
 'protein, ua',
 'protein, urine qualitative',
 'protein, urine, normalized',
 'protein, urine, random',
 'protein,total',
 'protein,total w/creat,random urine',
 'protein,total, peritoneal',
 'protein,total,24 hour ur',
 'protein,total,24 hour urine',
 'protein,total,24hr urine',
 'protein,total,peritoneal fld',
 'protein,total,plasma',
 'protein,total,pleural fluid',
 'protein,total,qual',
 'protein,total,random urine',
 'protein/creat ratio',
 'protein/creatinine ratio',
 'proteinase 3 ab',
 'proteinase 3 ab (pr3)',
 'proteinase-3 ab',
 'proteinase-3 ab-quest',
 'proteinase-3 antibody',
 'pth,related protein',
 'rat urine proteins (e74) ige',
 'retinol binding protein',
 'ribonucleic protein (u1) (ena) antibody, igg',
 'total protein',
 'total protein mg/dl',
 'ua protein'
]
get_unit(new_lab, old_lab, protein)

14-3-3 eta protein: ['ng/mL']
14.3.3 eta protein: ['ng/mL']
abnormal protein band 1: ['mg/dL', 'g/dL', 'GM/DL']
abnormal protein band 2: ['GM/DL']
abnormal protein band 3: ['GM/DL']
alpha fetoprotein, tumor marke: ['ng/mL']
antiproteinase 3 (pr-3) abs: ['U/mL']
apolipoprotein a1: ['mg/dL']
apolipoprotein b: ['mg/dL', 'MG/DL']
b2 glycoprotein i (igg)ab: ['SGU']
b2 glycoprotein i (igm)ab: ['SMU']
b2 glycoprotein i ab (iga): ['SAU', 'U/mL']
b2 glycoprotein i ab (igg): ['SGU', 'U/mL']
b2 glycoprotein i ab (igm): ['SMU', 'U/mL']
b2glycoprotein1, iga antibody: ['U/mL']
b2glycoprotein1, igg antibody: ['U/mL']
b2glycoprotein1, igm antibody: ['U/mL']
c-reactive protein: [nan, 'mg/L', 'MG/DL', 'mg/dL', 'MG/L']
free protein s ag.: ['%']
igf binding protein 1 (igfbp 1: ['ng/mL']
igf binding protein-1: ['NG/ML']
lab report: protein electro, 24-hour urine: [nan]
lipoprotein (a): ['nmol/L']
lp-pla2 lipoprotein: ['NG/ML']
monoclonal protein 1: ['G/DL', 'GM/DL']
monoclonal protein 2: ['GM/DL']
mouse urine proteins (e72) ige: ['kU/L']
protein: [nan]
protein 24 hour urine: ['mg/24hr']
protein 24 hour volume: ['mL']
protein [mass/volume] in serum or plasma: ['g/dL']
protein c: [nan]
protein c activity: ['%']
protein c,activity: [nan, 'PERCENT']
protein c,antigen: [nan, 'PERCENT']
protein creatinine ratio: [nan, 'MG/G CREATININE']
protein s: [nan]
protein s,activity: [nan, 'PERCENT']
protein s,antigen: [nan, 'PERCENT', '% normal']
protein urine random: ['mg/dL']
protein urine-qual: ['mg/dL']
protein, poc urine: [nan]
protein, random, urine: ['mg/dL']
protein, total: ['g/dL', 'G/DL']
protein, total serum: ['g/dL']
protein, total, 24 hr ur: ['mg/24 h']
protein, total, pleural: ['g/dL']
protein, total, random ur: ['mg/dL']
protein, total-quest: ['gm/dL']
protein, ua: [nan]
protein, urine qualitative: ['mg/dL']
protein, urine, normalized: ['mg/g creat']
protein, urine, random: [nan, 'mg/dL']
protein,total: [nan, 'G/DL', 'GM/DL']
protein,total w/creat,random urine: ['MG/DL']
protein,total, peritoneal: ['g/dL']
protein,total,24 hour ur: ['mg/24 h']
protein,total,24 hour urine: [nan, 'MG/G CREATININ', 'MG/24 HRS', 'MG/24HRS.', 'MG/G CREATININE']
protein,total,24hr urine: ['MG/24 HRS']
protein,total,peritoneal fld: ['g/dL']
protein,total,plasma: ['GM/DL']
protein,total,pleural fluid: ['g/dL']
protein,total,qual: [nan]
protein,total,random urine: ['MG/DL', 'MG/G CREATININE']
protein/creat ratio: [nan, 'mg/g creat']
protein/creatinine ratio: [nan, 'MG/G CREATININE', 'mg/g creat', 'MG/MG CREATININE', 'mg/mg creat', 'g/dL', 'Ratio']
proteinase 3 ab: ['U']
proteinase 3 ab (pr3): ['U']
proteinase-3 ab: ['U/mL', 'UNITS/ML', 'AI']
proteinase-3 ab-quest: [nan]
proteinase-3 antibody: ['AI']
pth,related protein: [nan, 'PG/ML', 'pg/mL']
rat urine proteins (e74) ige: ['KU/L']
retinol binding protein: ['MG/DL']
ribonucleic protein (u1) (ena) antibody, igg: ['AU/mL']
total protein: ['mg/dL', 'g/dL', 'mg/d']
total protein mg/dl: ['MG/DL']
ua protein: [nan, '1', 'mg/dL', '/HPF', 'mg/24h', 'L']

In [4]:
#tma_in_tma_lab_without_dob_in_master = pd.read_txt('tma_in_tma_lab_without_dob_in_master.txt')
read_file = pd.read_csv (r'tma_in_tma_lab_without_dob_in_master.txt')
read_file.to_csv (r'tma_in_tma_lab_without_dob_in_master.csv', index=None)

In [5]:
read_file

Empty DataFrame
Columns: [[6,  32780,  32803,  32809,  32812,  32816,  32828,  64,  32833,  32836,  32841,  32865,  32866,  32887,  32890,  32897,  32916,  153,  154,  32948,  32956,  32972,  32995,  32999,  33021,  33024,  33025,  33029,  33039,  33042,  33050,  33051,  287,  33078,  311,  33093,  33094,  33099,  33100,  33108,  343,  33113,  33114,  33115,  349,  356,  33127,  33144,  33147,  385,  387,  33158,  33191,  434,  33210,  445,  450,  454,  33227,  461,  466,  33236,  33237,  33240,  33248,  33253,  33261,  33274,  33277,  33294,  33302,  33309,  590,  33364,  33366,  33383,  33395,  647,  33425,  33448,  697,  33467,  708,  716,  33495,  33496,  33514,  33528,  766,  33542,  779,  33550,  33551,  33568,  33571,  33584,  33591,  33594,  851,  857, ...]
Index: []

[0 rows x 5416 columns]

In [13]:
res = pd.DataFrame(columns=('TMA_Acct', 'age'))
for i in read_file:
    if '[' in i:
        i = 6
    elif ']' in i:
        i = 32754
    res = res.append([{'TMA_Acct':i}], ignore_index=True)

In [20]:
res.to_csv('tma_in_tma_lab_without_dob_in_master.csv')

In [18]:
res['TMA_Acct'] = res['TMA_Acct'].astype(int)

In [19]:
res.sort_values('TMA_Acct')

      TMA_Acct  age
0            6  NaN
7           64  NaN
17         153  NaN
18         154  NaN
32         287  NaN
...        ...  ...
4844     53432  NaN
4847     53441  NaN
4848     53459  NaN
4850     53506  NaN
4855     53573  NaN

[5416 rows x 2 columns]

In [3]:
master[master['TMA_Acct'] == 268]

,Unnamed: 0,TMA_Acct,Account_Date,Sex,DOB,Marital_Status,Race,Location,Zip_Code,Patient_Status_Date,Patient_Status,Ethnicity,Language
99,99,268,06-01-2009,Female,24-08-1926,NaN,White,Tma,15317-3172,4-18-2012,Deceased,NaN,NaN

In [4]:
tma = pd.read_csv('TMA.csv')

In [ ]:
check = pd.DataFrame(base.groupby('TMA_Acct').size() > 1).reset_index()
check = list(set(check[check[0] == True]['TMA_Acct']))
len(check)

In [4]:
len(old_lab) + len(new_lab) + len(master)

3926459

In [134]:
print(master[master['TMA_Acct'] == 36531]['Race']

11361                            Asian
14431    Declined to Specify / Unknown
Name: Race, dtype: object

In [4]:
master.head(2)

,Unnamed: 0,TMA_Acct,Account_Date,Sex,DOB,Marital_Status,Race,Location,Zip_Code,Patient_Status_Date,Patient_Status,Ethnicity,Language
0,0,9,06-01-2009,Male,20-04-1921,NaN,White,Hopewell Office,15001,6-30-2010,Deceased,NaN,NaN
1,1,10,06-01-2009,Female,18-05-1926,NaN,NaN,Tma,15360,NaN,Active,NaN,NaN

In [15]:
old_lab.head(2)

,Unnamed: 0,TMA_Acct,Lab_Date,Code,Results,Lab_Company,Status,Units,Order_Doctor
0,0,9,2008-08-29,iron tibc,305.6,ALIQHOSP,NaN,NaN,NaN
1,1,9,2005-01-03,hemoglobin,13.4,ALIQHOSP,NaN,NaN,NaN

In [13]:
new = new_lab[['TMA_Acct', 'date']]
new = new.groupby(['TMA_Acct']).min()

In [16]:
old = old_lab[['TMA_Acct', 'Lab_Date']]
old = old.groupby(['TMA_Acct']).min()

In [20]:
new_2016 = new[new['date'] > '2016-12-31'].reset_index()
len(new_2016["TMA_Acct"].unique())

831

In [21]:
old_2016 = old[old['Lab_Date'] > '2016-12-31'].reset_index()
len(old_2016["TMA_Acct"].unique())

6312

In [22]:
old_2016["TMA_Acct"].unique()[0]

6

In [23]:
old_lab[old_lab['TMA_Acct'] == 6]

,Unnamed: 0,TMA_Acct,Lab_Date,Code,Results,Lab_Company,Status,Units,Order_Doctor
1856091,1856091,6,2017-02-20,wbc,9.6,Default Lab,Closed,NaN,Tma Doctor
1856092,1856092,6,2017-02-20,vitamin d,39.6,Default Lab,Closed,NaN,Tma Doctor
1856093,1856093,6,2017-02-20,urine cr/r,264 MG/DL,Default Lab,Closed,NaN,Tma Doctor
1856094,1856094,6,2017-02-20,uric acid,7.9,Default Lab,Closed,NaN,Tma Doctor
1856095,1856095,6,2017-02-20,urea nitro,32,Default Lab,Closed,NaN,Tma Doctor
...,...,...,...,...,...,...,...,...,...
1856164,1856164,6,2017-02-20,abs mono,1,Default Lab,Closed,NaN,Tma Doctor
1856165,1856165,6,2017-02-20,abs lymph,2.1,Default Lab,Closed,NaN,Tma Doctor
1856166,1856166,6,2017-02-20,abs eosin,0.2,Default Lab,Closed,NaN,Tma Doctor
1856167,1856167,6,2017-02-20,abs baso,0,Default Lab,Closed,NaN,Tma Doctor
1856168,1856168,6,2017-02-20,a/g ratio,NaN,Default Lab,Closed,NaN,Tma Doctor

In [57]:
Diagnosis.head(2)

,Unnamed: 0,Acct_No,Date,Code,Description,Unnamed: 4
0,0,86,2017-08-11,T82.898A,Other specified complication of vascular prost...,NaN
1,1,86,2017-08-11,T82.858A,"Stenosis of other vascular prosthetic devices,...",NaN

In [37]:
#len(pd.read_csv("lab_2017.csv")) + len(pd.read_csv("lab_2018.csv")) + len(pd.read_csv("lab_till_2017.csv"))
570649 + 622573 + 1730136

3037147

In [4]:
# different names for the test
new = new_lab["test_name"].unique()
old = old_lab["Code"].unique()
hemo = []
for i in old:
    i = str(i)
    i = i.lower()
    if "hemo" in i:
        hemo.append(i)
cre = []
for i in old:
    i = str(i)
    i = i.lower()
    if "creatin" in i:
        #print(i)
        cre.append(i)
egfr = []
for i in old:
    i = str(i)
    i = i.lower()
    if "egfr" in i:
        #print(i)
        egfr.append(i)
co2 = []
for i in old:
    i = str(i)
    i = i.lower()
    if "co2" in i:
        #print(i)
        co2.append(i)
po4 = []
for i in old:
    i = str(i)
    i = i.lower()
    if "phospha" in i:
        #print(i)
        po4.append(i)
pth = []
for i in old:
    i = str(i)
    i = i.lower()
    if "parath" in i:
        #print(i)
        pth.append(i)
    if "pth" in i:
        #print(i)
        pth.append(i)
protein = []
for i in old:
    i = str(i)
    i = i.lower()
    if "protein" in i:
        #print(i)
        protein.append(i)
    if "uacr" in i:
        print(i)
        protein.append(i)
co3 = []
for i in old:
    i = str(i)
    i = i.lower()
    if "protein" in i:
        #print(i)
        protein.append(i)
    if "uacr" in i:
        print(i)
        protein.append(i)

In [23]:
new = new_lab["test_name"].unique()
old = old_lab["test_name"].unique()
co3_old = []
co3_new = []
for i in old:
    i = str(i)
    i = i.lower()
    if "co3" in i:
        #print(i)
        co3_old.append(i)
for i in new:
    i = str(i)
    i = i.lower()
    if "co3" in i:
        #print(i)
        co3_new.append(i)

In [8]:
co3_old

['hco3', 'hco3-']

In [24]:
co3_new

[]

In [25]:
old_lab[old_lab['test_name'] == 'hco3-']

,Unnamed: 0,TMA_Acct,date,test_name,result,Lab_Company,Status,Units,Order_Doctor
2524046,2524046,8073,2018-07-01,hco3-,15.9,Washington Hospital,Closed,mmol/L,"Nirav D. Patel, M.D."
2678630,2678630,50519,2018-05-07,hco3-,27.4,N2N/CCD Import,Closed,mmol/L,NaN
2678778,2678778,50519,2018-05-05,hco3-,23.1,N2N/CCD Import,Closed,mmol/L,NaN
2678898,2678898,50519,2018-05-04,hco3-,23.2,N2N/CCD Import,Closed,mmol/L,NaN
2678899,2678899,50519,2018-05-04,hco3-,22.1,N2N/CCD Import,Closed,mmol/L,NaN
2704936,2704936,42145,2018-05-25,hco3-,31.3,Washington Hospital,Closed,mmol/L,"Joshua C. Sysak, DO"

In [10]:
co3 = ['hco3', 'hco3-']
get_unit(new_lab, old_lab, co3)

hco3: [nan]
hco3-: ['mmol/L']

In [22]:
new_lab[new_lab['test_name'] == 'hco3']

Empty DataFrame
Columns: [Unnamed: 0, TMA_Acct, dos_deidentified, clinic_name_deidentified, test_name, result, Units, abnormal_flag, range_low_value, range_high_value, loinc_code, date]
Index: []

In [31]:
import sqlite3
conn = sqlite3.connect(':memory:')
race.to_sql('race', conn, index=False)
qry1 = '''
    select *
    from race
    where Ethnicity is not NULL or Race is not null
    '''
race_keep = pd.read_sql_query(qry1, conn)
race_keep

      TMA_Acct                      Race                       Ethnicity
0            9                     White                            None
1           12                     White                            None
2           37                     White  Not of Spanish/Hispanic Origin
3           55                     White                            None
4           63                     White                            None
...        ...                       ...                             ...
9669      9737                     White   Declined to Specify / Unknown
9670      9791                     White           Not Hispanic / Latino
9671      9801                     White   Declined to Specify / Unknown
9672      9869                     White   Declined to Specify / Unknown
9673      9933  Black / African American           Not Hispanic / Latino

[9674 rows x 3 columns]

In [50]:
import sqlite3
conn = sqlite3.connect(':memory:')
race.to_sql('race', conn, index=False)
qry1 = '''
    select *
    from race
    group by TMA_Acct
    having count(*) > 1
    '''
pd.read_sql_query(qry1, conn)

      TMA_Acct                    Race                       Ethnicity
0           86                   White                         Unknown
1           97                   White  Not of Spanish/Hispanic Origin
2          125                   White  Not of Spanish/Hispanic Origin
3          214                   White  Not of Spanish/Hispanic Origin
4          215                   White                            None
...        ...                     ...                             ...
1589     46892                   White                            None
1590     46896                   White                            None
1591     46927                   White                            None
1592     46942  Black/African American                            None
1593     46985                   White                            None

[1594 rows x 3 columns]

In [13]:
min(maping['claim_number_deidentified']) # 1 - 6295280
min(maping['TMA_Acct']) # 9 - 50970

9

In [3]:
new_lab.head(2)

,Unnamed: 0,TMA_Acct,dos_deidentified,clinic_name_deidentified,test_name,test_result,test_unit,abnormal_flag,range_low_value,range_high_value,loinc_code,date
0,0,1483,15,1.0,rbc/hpf cells,0.0,NaN,,0.0,3.0,58081,2010-01-16
1,1,49053,2759,2.0,ld,237.0,UNITS,,120.0,250.0,25320,2017-07-22

In [7]:
print(len(new_lab))
print(len(new_lab["TMA_Acct"].unique()))
print(min(new_lab["date"]))
print(max(new_lab["date"]))

986691
4505
2010-01-03
2020-04-19

In [14]:
new_co2_1 = new_lab[new_lab["test_name"] == "co2"] #2
new_co2_2 = new_lab[new_lab["test_name"] == 'carbon dioxide (co2)'] #5
print(len(new_co2_1))
print(len(new_co2_2))
new_co2 = pd.concat([new_co2_1, new_co2_2], axis = 0)

2
5

In [16]:
new_co2 = new_co2[1:]

In [4]:
old_lab.head(2)

,Unnamed: 0,TMA_Acct,Lab_Date,Code,Results,Lab_Company,Status,Units,Order_Doctor
0,0,9,2008-08-29,iron tibc,305.6,ALIQHOSP,NaN,NaN,NaN
1,1,9,2005-01-03,hemoglobin,13.4,ALIQHOSP,NaN,NaN,NaN

In [8]:
print(len(old_lab))
print(len(old_lab["TMA_Acct"].unique()))
print(min(old_lab["Lab_Date"]))
print(max(old_lab["Lab_Date"]))

2923358
12947
1990-08-06 00:00:00
2018-12-31 00:00:00

In [12]:
old_co2_1 = old_lab[old_lab["Code"] == "co2"] #93
old_co2_2 = old_lab[old_lab["Code"] == 'carbon dioxide (co2)'] #0
print(len(old_co2_1))
print(len(old_co2_2))
old_co2 = old_co2_1
print(len(old_co2))

93
0
93

In [5]:
len(new_lab)

986691

lab_till_2017 = pd.read_csv("lab_till_2017.csv")
lab_till_2017 = lab_till_2017[["Unnamed: 0", "Acct_Nr", "Lab_Date", "Code", "Results", "Lab_Company", "Status", "Units", "Order_Doctor"]]
lab_201718 = pd.read_csv("lab_201718.csv")
lab_201718 = lab_201718[["Unnamed: 0", "Acct_no", "Date", "Code", "Results", "Lab Company", "Status", "Units", "Order Doctor"]]
lab_201718.rename(columns={"Acct_no": "Acct_Nr", "Date": "Lab_Date", "Lab Company": "Lab_Company", "Order Doctor": "Order_Doctor"}, inplace = 'True')

In [17]:
old_co2.head(2)

,Unnamed: 0,TMA_Acct,Lab_Date,Code,Results,Lab_Company,Status,Units,Order_Doctor
851179,851179,19138,2016-11-18,co2,34,N2N/CCD Import,Closed,mmol/L,NaN
851413,851413,19138,2016-11-20,co2,31,N2N/CCD Import,Closed,mmol/L,NaN

In [21]:
len(old_co2["TMA_Acct"].unique())

44

In [24]:
new_co2.head(2)

        TMA_Acct        date  test_result
750263     17425  2013-05-24         26.0
70074      42485  2017-07-19         22.0

In [22]:
len(new_co2["TMA_Acct"].unique())

3

In [27]:
old_co2 = old_co2[["TMA_Acct", "Lab_Date", "Results"]]
new_co2 = new_co2[["TMA_Acct", "date", "test_result"]]
new_co2.rename(columns={"date": "Lab_Date", "test_result": "Results"}, inplace = 'True')
co2 = pd.concat([old_co2, new_co2], axis = 0)

In [30]:
co2["Lab_Date"] =  pd.to_datetime(co2.Lab_Date)

In [33]:
co2["mindate"] = min(co2["Lab_Date"])
co2["Time"] = np.floor(((pd.to_datetime(co2['Lab_Date']) - pd.to_datetime(co2['mindate'])).dt.days) / 180) + 1
co2["Results"] = co2["Results"].astype(float)
co2_agg = co2.groupby(["TMA_Acct", "Time"]).agg({"Results": np.mean})
co2_agg = co2_agg.reset_index()
import sqlite3
conn = sqlite3.connect(':memory:')
co2_agg.to_sql('co2_agg', conn, index=False)
qry1 = '''
    select *
    from co2_agg
    where TMA_Acct in (select TMA_Acct from co2_agg group by TMA_Acct having count(*) > 2)
    '''
co2_keep = pd.read_sql_query(qry1, conn)

In [3]:
check = pd.read_csv("bothindata_with_nultipletma.csv")

In [19]:
check = pd.read_csv("bothindata_with_nultipletma.csv")
acct = []
for i in check["TMA Acct#"]:
    #print(i)
    acct.extend(i[1:len(i)-1].split(' '))
acct = [int(i) for i in acct if i != '']
len(acct)

In [35]:
acct = [int(i) for i in acct if i != '']
len(acct)

291

In [25]:
master_acct = master["TMA_Acct"].unique()

In [33]:
old_lab_acct = old_lab["TMA_Acct"].unique()
old_lab_acct

array([    9,    12,    16, ..., 49940, 49501, 37557], dtype=int64)

In [29]:
new_lab_acct = new_lab["TMA_Acct"].unique()

In [36]:
acct_in_old = []
acct_not_in_old = []
acct_in_new = []
acct_not_in_new = []
for i in acct:
    #print(type(i))
    if i in old_lab_acct:
        acct_in_old.append(i)
    if i not in old_lab_acct:
        acct_not_in_old.append(i)
    if i in new_lab_acct:
        acct_in_new.append(i)
    if i not in new_lab_acct:
        acct_not_in_new.append(i)

In [39]:
len(acct_in_new) + len(acct_not_in_new)

291

In [51]:
filename = 'acct_in_master.txt'
with open(filename,'w') as f: # 如果filename不存在会自动创建， 'w'表示写数据，写之前会清空文件中的原有数据！
    for i in acct_in_master:
        f.write(str(i) + '\n')

In [49]:
acct_in_master = []
acct_not_in_master = []
for i in acct:
    #print(type(i))
    if i in master_acct:
        acct_in_master.append(i)
    if i not in master_acct:
        acct_not_in_master.append(i)

In [2]:
new_lab = pd.read_csv("df_labdata.csv")
new_lab.rename(columns={"test_result": "result", "test_unit": 'Units'}, inplace = 'True')
old_lab = pd.read_csv('TMA_lab.csv')
old_lab['Lab_Date'] = pd.to_datetime(old_lab.Lab_Date)
old_lab.rename(columns={"Lab_Date": "date", "Results": "result", "Code": "test_name"}, inplace = 'True')
master = pd.read_csv("master.csv")
masnew = pd.read_csv('master_new.csv')
masnew.rename(columns={"ACCT": "TMA_Acct"}, inplace = 'True')

In [4]:
def uniq_unit(df):
    print(list(set(df['Units'])))
def data(df, name):
    display(df[df['test_name'] == name])
def tl(data1, data2):
    print(len(data1) + len(data2))

In [46]:
hemo_name = ['hemoglobin', 'hemoglobin and hematocrit', 'hemoglobin,plasma'] 
new_hemo = new_lab[new_lab['test_name'].isin(hemo_name)][['test_name', 'result', 'Units']]
old_hemo = old_lab[old_lab['test_name'].isin(hemo_name)][['test_name', 'result', 'Units']]
tl(new_hemo, old_hemo)

83965

In [47]:
data(old_hemo, 'hemoglobin,plasma')

Empty DataFrame
Columns: [test_name, result, Units]
Index: []

In [7]:
pho_name = ['phosphate', 'phosphate (as phosphorus)'] 
new_pho = new_lab[new_lab['test_name'].isin(pho_name)][['TMA_Acct','test_name', 'result', 'Units']]
old_pho = old_lab[old_lab['test_name'].isin(pho_name)][['TMA_Acct', 'test_name', 'result', 'Units']]
# uniq_unit(new_pho)
# uniq_unit(old_pho)
tl(new_pho, old_pho)

330

In [10]:
len(set(list(new_pho['TMA_Acct']) + list(old_pho['TMA_Acct'])))

172

In [24]:
data(new_pho, 'phosphate (as phosphorus)')

                        test_name  result  Units
269     phosphate (as phosphorus)     1.4  mg/dL
2368    phosphate (as phosphorus)     3.7  mg/dL
5046    phosphate (as phosphorus)     0.0  mg/dL
7767    phosphate (as phosphorus)     2.9  mg/dL
8859    phosphate (as phosphorus)     3.7  mg/dL
...                           ...     ...    ...
971638  phosphate (as phosphorus)     3.7  mg/dL
972405  phosphate (as phosphorus)     3.2  mg/dL
973796  phosphate (as phosphorus)     3.1  mg/dL
974237  phosphate (as phosphorus)     2.9  mg/dL
980043  phosphate (as phosphorus)     3.5  mg/dL

[328 rows x 3 columns]

In [49]:
pth_name = ['intact pth', 'ipth', 'calc (pth)', 'parathyrin.intact', 'parathyroid hormone, intact', 'pth', 'pth ab', 'pth calcium', 'pth in', 'pth intact', 'pth n term', 'pth, intact', 'pth,int', 'pth,intact'] 
new_pth = new_lab[new_lab['test_name'].isin(pth_name)][['test_name', 'result', 'Units']]
old_pth = old_lab[old_lab['test_name'].isin(pth_name)][['test_name', 'result', 'Units']]
uniq_unit(new_pth)
uniq_unit(old_pth)
tl(new_pth, old_pth)

[nan, 'PG/ML', 'pg/mL']
[nan, 'PG/ML', 'ClosedPG/ML', 'pg/ml', 'HPF', 'pg/mL', 'mg/dL', 'LPF']
33333

In [37]:
data(new_pth, 'pth, int')

Empty DataFrame
Columns: [test_name, result, Units]
Index: []

In [11]:
co_name = ['carbon dioxide (co2)','co2','total co2'] 
new_co = new_lab[new_lab['test_name'].isin(co_name)][['TMA_Acct','test_name', 'result', 'Units']]
old_co = old_lab[old_lab['test_name'].isin(co_name)][['TMA_Acct', 'test_name', 'result', 'Units']]
# uniq_unit(new_co)
# uniq_unit(old_co)
tl(new_co, old_co)

112

In [12]:
len(set(list(new_co['TMA_Acct']) + list(old_co['TMA_Acct'])))

59

In [44]:
data(new_co, 'carbon dioxide (co2)')

                   test_name  result   Units
70074   carbon dioxide (co2)    22.0  mmol/L
336497  carbon dioxide (co2)    19.0  mmol/L
515740  carbon dioxide (co2)    21.0  mmol/L
792918  carbon dioxide (co2)    24.0  mmol/L
970524  carbon dioxide (co2)    31.0  mmol/L